Tekla Open API Reference for Tekla Structures 2025
PhaseCollection Class
 The PhaseCollection class handles the collection of the model phases.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.PhaseCollection
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PhaseCollection : ICollection,
	IEnumerable
<SerializableAttribute>
Public Class PhaseCollection
	Implements ICollection, IEnumerable
The PhaseCollection type exposes the following members.
Properties
Name | Description
Count
 Gets the number of elements contained in the ICollection.
IsSynchronized
 Gets a value indicating whether access to the ICollection is synchronized (thread safe).
SyncRoot
 Gets an object that can be used to synchronize access to the ICollection.
Top
Methods
Name | Description
CopyTo
 Copies the elements of the ICollection to an Array, starting at a particular Array index.
GetEnumerator
 Returns an enumerator that iterates through a collection.
Top
Examples
 The following example gets the phases of the model and shows the values of the PhaseName and PhaseNumber properties in a message dialog:
using Tekla.Structures.Model;
using System.Windows.Forms;
public class Example
{
       public void Example1()
       {
           Model CurrentModel = new Model();
           PhaseCollection PhaseCollection = CurrentModel.GetPhases();
           if (CurrentModel.GetConnectionStatus())
           {
               foreach(Phase p in PhaseCollection)
               {
                    MessageBox.Show("Name = " + p.PhaseName + ", number = " + p.PhaseNumber);
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Model Namespace